# -*- coding: utf-8 -*-
import json
import re

def gettelnum(s):       #获得电话号码
    res = re.search(r'\d{11}', s)
    if res == None:
        return ""
    return res.group(0)

def getprovince(s):      ##获得省
    res = re.search(("(.*?省)|(.*?自治区)|上海市|北京市|天津市|重庆市"), s)
    if res != None:
        l = len(res.group(0))
    if res == None or l > 5:
        if s[0:3] == "黑龙江":
            return "黑龙江"
        if s[0:3] == "内蒙古":
            return "内蒙古"
        else:
            return s[0:2]
    return res.group(0)

def getcity(s):            #获得城镇
    res = re.search("(.*?自治州)|(.*?[市])", s)
    if res != None:
        l = len(res.group(0))
    if res == None or l > 7:
        for i in CITIES:
            if s[0:2] in i:
                return i
        return ""
    return res.group(0)

def getcounty(s):            #获得县
    #print(s)
    res = re.search("(.*?自治旗)|(.*?[县区市旗])", s)
    if res == None:
        #print("_____________________")
        for i in AREAS:
            if s[0:2] in i:
                return i
        return ""
    return res.group(0)

def gettown(s):         #获得城镇
    res = re.search("(.*?[镇乡])|(.*?街道)", s)
    if res == None:
        return ""
    return res.group(0)

def getroad(s): #获得路
    res = re.search("(.*?[路街巷道])", s)
    if res == None:
        return ""
    return res.group(0)

def getdoornum(s):                         #获得门牌号
    res = re.search("(.*?[号])", s)
    if res == None:
        return ""
    return res.group(0)

CITIES=['乌鲁木齐', '克拉玛依', '拉萨 ', '银川', '石嘴山', '吴忠', '固原', '中卫', '呼和浩特', '包头', '乌海', '赤峰', '通辽', '鄂尔多斯', '呼伦贝尔', '巴彦淖尔', '乌兰察布', '南宁', '柳州', '桂林', '梧州', '北海', '崇左', '来宾', '贺州', '玉林', '百色', '河池', '钦州', '防城港', '贵港', '哈尔滨', '大庆', '齐齐哈尔', '佳木斯', '鸡西', '鹤岗', '双鸭山', '牡丹江', '伊春', '七台河', '黑河', '绥化', '长春', '吉林', '四平', '辽源', '通化', '白山', '松原', '白城', '沈阳', '大连', '鞍山', '抚顺', '本溪', '丹东', '锦州', '营口', '阜新', '辽阳', '盘锦', '铁岭', '朝阳', '葫芦岛', '石家庄', '唐山', '邯郸', '秦皇岛', '保定', '张家口', '承德', '廊坊', '沧州', '衡水', '邢台', '济南', '青岛', '淄博', '枣庄', '东营', '烟台', '潍坊', '济宁', '泰安', '威海', '日照', '莱芜', '临沂', '德州', '聊城', '菏泽', '滨州', '南京', '镇江', '常州', '无锡', '苏州', '徐州', '连云港', '淮安', '盐城', '扬州', '泰州', '南通', '宿迁', '合肥', '蚌埠', '芜湖', '淮南', '亳州', '阜阳', '淮北', '宿州', '滁州', '安庆', '巢湖', '马鞍山', '宣城', '黄山', '池州', '铜陵', '杭州', '嘉兴', '湖州', '宁波', '金华', '温州', '丽水', '绍兴', '衢州', '舟山', '台州', '福州', '厦门', '泉州', '三明', '南平', '漳州', '莆田', '宁德', '龙岩', '广州', '深圳', '汕头', '惠州', '珠海', '揭阳', '佛山', '河源', '阳江', '茂名', '湛江', '梅州', '肇庆', '韶关', '潮州', '东莞', '中山', '清远', '江门', '汕尾', '云浮', '海口', '三亚', '昆明', '曲靖', '玉溪', '保山', '昭通', '丽江', '普洱', '临沧', '贵阳', '六盘水', '遵义', '安顺', '成都', '绵阳', '德阳', '广元', '自贡', '攀枝花', '乐山', '南充', '内江', '遂宁', '广安', '泸州', '达州', '眉山', '宜宾', '雅安', '资阳', '长沙', '株洲', '湘潭', '衡阳', '岳阳', '郴州', '永州', '邵阳', '怀化', '常德', '益阳', '张家界', '娄底 ', '武汉', '襄樊', '宜昌', '黄石', '鄂州', '随州', '荆州', '荆门', '十堰', '孝感', '黄冈', '咸宁', '郑州', '洛阳', '开封', '漯河', '安阳', '新乡', '周口', '三门峡', '焦作', '平顶山', '信阳', '南阳', '鹤壁', '濮阳', '许昌', '商丘', '驻马店', '太原', '大同', '忻州', '阳泉', '长治', '晋城', '朔州', '晋中', '运城', '临汾', '吕梁', '西安', '咸阳', '铜川', '延安', '宝鸡', '渭南', '汉中', '安康', '商洛', '榆林', '兰州', '天水', '平凉', '酒泉', '嘉峪关', '金昌', '白银', '武威', '张掖', '庆阳', '定西', '陇南', '西宁', '南昌', '九江', '赣州', '吉安', '鹰潭', '上饶', '萍乡', '景德镇', '新余', '宜春', '抚州','延边朝鲜族自治州', '恩施土家族苗族自治州', '湘西土家族苗族自治州', '临夏回族自治州', '甘南藏族自治州', '甘孜藏族自治州', '凉山彝族自治州', '阿坝藏族羌族自治州', '黔东南苗族侗族自治州', '黔南布依族苗族自治州', '黔西南布依族苗族自治州', '昌吉回族自治州', '伊犁哈萨克自治州', '博尔塔拉蒙古自治州', '巴音郭楞蒙古自治州', '黄南藏族自治州', '海北藏族自治州', '海南藏族自治州', '果洛藏族自治州', '玉树藏族自治州', '海西蒙古族藏族自治州', '迪庆藏族自治州', '楚雄彝族自治州', '大理白族自治州', '怒江傈僳族自治州', ' 西双版纳傣族自治州', '文山壮族苗族自治州', '德宏傣族景颇族自治州', '红河哈尼族彝族自治州', '克孜勒苏柯尔克孜自治州']
AREAS = ['东城区', '西城区', '朝阳区', '丰台区', '石景山区', '海淀区', '门头沟区', '房山区', '通州区', '顺义区', '昌平区', '大兴区', '怀柔区', '平谷区', '密云区', '延庆区', '和平区', '河东区', '河西区', '南开区', '河北区', '红桥区', '东丽区', '西青区', '津南区', '北辰区', '武清区', '宝坻区', '滨海新区', '宁河区', '静海区', '蓟州区', '长安区', '桥西区', '新华区', '井陉矿区', '裕华区', '藁城区', '鹿泉区', '栾城区', '井陉县', '正定县', '行唐县', '灵寿县', '高邑县', '深泽县', '赞皇县', '无极县', '平山县', '元氏县', '赵县', '石家庄高新技术产业开发区', '石家庄循环化工园区', '辛集市', '晋州市', '新乐市', '路南区', '路北区', '古冶区', '开平区', '丰南区', '丰润区', '曹妃甸区', '滦南县', '乐亭县', '迁西县', '玉田县', '唐山市芦台经济技术开发区', '唐山市汉沽管理区', '唐山高新技术产业开发区', '河北唐山海港经济开发区', '遵化市', '迁安市', '滦州市', '海港区', '山海关区', '北戴河区', '抚宁区', '青龙满族自治县', '昌黎县', '卢龙县', '秦皇岛市经济技术开发区', '北戴河新区', '邯山区', '丛台区', '复兴区', '峰峰矿区', '肥乡区', '永年区', '临漳县', '成安县', '大名县', '涉县', '磁县', '邱县', '鸡泽县', '广平县', '馆陶县', '魏县', '曲周县', '邯郸经济技术开发区', '邯郸冀南新区', '武安市', '桥东区', '桥西区', '邢台县', '临城县', '内丘县', '柏乡县', '隆尧县', '任县', '南和县', '宁晋县', '巨鹿县', '新河县', '广宗县', '平乡县', '威县', '清河县', '临西县', '河北邢台经济开发区', '南宫市', '沙河市', '竞秀区', '莲池区', '满城区', '清苑区', '徐水区', '涞水县', '阜平县', '定兴县', '唐县', '高阳县', '容城县', '涞源县', '望都县', '安新县', '易县', '曲阳县', '蠡县', '顺平县', '博野县', '雄县', '保定高新技术产业开发区', '保定白沟新城', '涿州市', '定州市', '安国市', '高碑店市', '桥东区', '桥西区', '宣化区', '下花园区', '万全区', '崇礼区', '张北县', '康保县', '沽源县', '尚义县', '蔚县', '阳原县', '怀安县', '怀来县', '涿鹿县', '赤城县', '张家口市高新技术产业开发区', '张家口市察北管理区', '张家口市塞北管理区', '双桥区', '双滦区', '鹰手营子矿区', '承德县', '兴隆县', '滦平县', '隆化县', '丰宁满族自治县', '宽城满族自治县', '围场满族蒙古族自治县', '承德高新技术产业开发区', '平泉市', '新华区', '运河区', '沧县', '青县', '东光县', '海兴县', '盐山县', '肃宁县', '南皮县', '吴桥县', '献县', '孟村回族自治县', '河北沧州经济开发区', '沧州高新技术产业开发区', '沧州渤海新区', '泊头市', '任丘市', '黄骅市', '河间市', '安次区', '广阳区', '固安县', '永清县', '香河县', '大城县', '文安县', '大厂回族自治县', '廊坊经济技术开发区', '霸州市', '三河市', '桃城区', '冀州区', '枣强县', '武邑县', '武强县', '饶阳县', '安平县', '故城县', '景县', '阜城县', '河北衡水高新技术产业开发区', '衡水滨湖新区', '深州市', '小店区', '迎泽区', '杏花岭区', '尖草坪区', '万柏林区', '晋源区', '清徐县', '阳曲县', '娄烦县', '山西转型综合改革示范区', '古交市', '新荣区', '平城区', '云冈区', '云州区', '阳高县', '天镇县', '广灵县', '灵丘县', '浑源县', '左云县', '山西大同经济开发区', '城区', '矿区', '郊区', '平定县', '盂县', '潞州区', '上党区', '屯留区', '潞城区', '襄垣县', '平顺县', '黎城县', '壶关县', '长子县', '武乡县', '沁县', '沁源县', '山西长治高新技术产业园区', '城区', '沁水县', '阳城县', '陵川县', '泽州县', '高平市', '朔城区', '平鲁区', '山阴县', '应县', '右玉县', '山西朔州经济开发区', '怀仁市', '榆次区', '榆社县', '左权县', '和顺县', '昔阳县', '寿阳县', '太谷县', '祁县', '平遥县', '灵石县', '介休市', '盐湖区', '临猗县', '万荣县', '闻喜县', '稷山县', '新绛县', '绛县', '垣曲县', '夏县', '平陆县', '芮城县', '永济市', '河津市', '忻府区', '定襄县', '五台县', '代县', '繁峙县', '宁武县', '静乐县', '神池县', '五寨县', '岢岚县', '河曲县', '保德县', '偏关县', '五台山风景名胜区', '原平市', '尧都区', '曲沃县', '翼城县', '襄汾县', '洪洞县', '古县', '安泽县', '浮山县', '吉县', '乡宁县', '大宁县', '隰县', '永和县', '蒲县', '汾西县', '侯马市', '霍州市', '离石区', '文水县', '交城县', '兴县', '临县', '柳林县', '石楼县', '岚县', '方山县', '中阳县', '交口县', '孝义市', '汾阳市', '新城区', '回民区', '玉泉区', '赛罕区', '土默特左旗', '托克托县', '和林格尔县', '清水河县', '武川县', '呼和浩特金海工业园区', '呼和浩特经济技术开发区', '东河区', '昆都仑区', '青山区', '石拐区', '白云鄂博矿区', '九原区', '土默特右旗', '固阳县', '达尔罕茂明安联合旗', '包头稀土高新技术产业开发区', '海勃湾区', '海南区', '乌达区', '红山区', '元宝山区', '松山区', '阿鲁科尔沁旗', '巴林左旗', '巴林右旗', '林西县', '克什克腾旗', '翁牛特旗', '喀喇沁旗', '宁城县', '敖汉旗', '科尔沁区', '科尔沁左翼中旗', '科尔沁左翼后旗', '开鲁县', '库伦旗', '奈曼旗', '扎鲁特旗', '通辽经济技术开发区', '霍林郭勒市', '东胜区', '康巴什区', '达拉特旗', '准格尔旗', '鄂托克前旗', '鄂托克旗', '杭锦旗', '乌审旗', '伊金霍洛旗', '海拉尔区', '扎赉诺尔区', '阿荣旗', '莫力达瓦达斡尔族自治旗', '鄂伦春自治旗', '鄂温克族自治旗', '陈巴尔虎旗', '新巴尔虎左旗', '新巴尔虎右旗', '满洲里市', '牙克石市', '扎兰屯市', '额尔古纳市', '根河市', '临河区', '五原县', '磴口县', '乌拉特前旗', '乌拉特中旗', '乌拉特后旗', '杭锦后旗', '集宁区', '卓资县', '化德县', '商都县', '兴和县', '凉城县', '察哈尔右翼前旗', '察哈尔右翼中旗', '察哈尔右翼后旗', '四子王旗', '丰镇市', '乌兰浩特市', '阿尔山市', '科尔沁右翼前旗', '科尔沁右翼中旗', '扎赉特旗', '突泉县', '二连浩特市', '锡林浩特市', '阿巴嘎旗', '苏尼特左旗', '苏尼特右旗', '东乌珠穆沁旗', '西乌珠穆沁旗', '太仆寺旗', '镶黄旗', '正镶白旗', '正蓝旗', '多伦县', '乌拉盖管委会', '阿拉善左旗', '阿拉善右旗', '额济纳旗', '内蒙古阿拉善经济开发区', '和平区', '沈河区', '大东区', '皇姑区', '铁西区', '苏家屯区', '浑南区', '沈北新区', '于洪区', '辽中区', '康平县', '法库县', '新民市', '中山区', '西岗区', '沙河口区', '甘井子区', '旅顺口区', '金州区', '普兰店区', '长海县', '瓦房店市', '庄河市', '铁东区', '铁西区', '立山区', '千山区', '台安县', '岫岩满族自治县', '海城市', '新抚区', '东洲区', '望花区', '顺城区', '抚顺县', '新宾满族自治县', '清原满族自治县', '平山区', '溪湖区', '明山区', '南芬区', '本溪满族自治县', '桓仁满族自治县', '元宝区', '振兴区', '振安区', '宽甸满族自治县', '东港市', '凤城市', '古塔区', '凌河区', '太和区', '黑山县', '义县', '凌海市', '北镇市', '站前区', '西市区', '鲅鱼圈区', '老边区', '盖州市', '大石桥市', '海州区', '新邱区', '太平区', '清河门区', '细河区', '阜新蒙古族自治县', '彰武县', '白塔区', '文圣区', '宏伟区', '弓长岭区', '太子河区', '辽阳县', '灯塔市', '双台子区', '兴隆台区', '大洼区', '盘山县', '银州区', '清河区', '铁岭县', '西丰县', '昌图县', '调兵山市', '开原市', '双塔区', '龙城区', '朝阳县', '建平县', '喀喇沁左翼蒙古族自治县', '北票市', '凌源市', '连山区', '龙港区', '南票区', '绥中县', '建昌县', '兴城市', '南关区', '宽城区', '朝阳区', '二道区', '绿园区', '双阳区', '九台区', '农安县', '长春经济技术开发区', '长春净月高新技术产业开发区', '长春高新技术产业开发区', '长春汽车经济技术开发区', '榆树市', '德惠市', '昌邑区', '龙潭区', '船营区', '丰满区', '永吉县', '吉林经济开发区', '吉林高新技术产业开发区', '吉林中国新加坡食品区', '蛟河市', '桦甸市', '舒兰市', '磐石市', '铁西区', '铁东区', '梨树县', '伊通满族自治县', '公主岭市', '双辽市', '龙山区', '西安区', '东丰县', '东辽县', '东昌区', '二道江区', '通化县', '辉南县', '柳河县', '梅河口市', '集安市', '浑江区', '江源区', '抚松县', '靖宇县', '长白朝鲜族自治县', '临江市', '宁江区', '前郭尔罗斯蒙古族自治县', '长岭县', '乾安县', '吉林松原经济开发区', '扶余市', '洮北区', '镇赉县', '通榆县', '吉林白城经济开发区', '洮南市', '大安市', '延吉市', '图们市', '敦化市', '珲春市', '龙井市', '和龙市', '汪清县', '安图县', '道里区', '南岗区', '道外区', '平房区', '松北区', '香坊区', '呼兰区', '阿城区', '双城区', '依兰县', '方正县', '宾县', '巴彦县', '木兰县', '通河县', '延寿县', '尚志市', '五常市', '龙沙区', '建华区', '铁锋区', '昂昂溪区', '富拉尔基区', '碾子山区', '梅里斯达斡尔族区', '龙江县', '依安县', '泰来县', '甘南县', '富裕县', '克山县', '克东县', '拜泉县', '讷河市', '鸡冠区', '恒山区', '滴道区', '梨树区', '城子河区', '麻山区', '鸡
